Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Inc/fm33ld5xx_fl_qspi.h
/**
  *******************************************************************************************************
  * @file    fm33lr0xx_fl_qspi.h
  * @author  FMSH Application Team
  * @brief   Head file of QSPI FL Module
  *******************************************************************************************************
  * @attention
  *
  * Copyright (c) [2019] [Fudan Microelectronics]
  * THIS SOFTWARE is licensed under the Mulan PSL v1.
  * can use this software according to the terms and conditions of the Mulan PSL v1.
  * You may obtain a copy of Mulan PSL v1 at:
  * http://license.coscl.org.cn/MulanPSL
  * THIS SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES OF ANY KIND, EITHER EXPRESS OR
  * IMPLIED, INCLUDING BUT NOT LIMITED TO NON-INFRINGEMENT, MERCHANTABILITY OR FIT FOR A PARTICULAR
  * PURPOSE.
  * See the Mulan PSL v1 for more details.
  *
  *******************************************************************************************************
  */


/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33LR0XX_FL_QSPI_H
#define __FM33LR0XX_FL_QSPI_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33ld5xx_fl_def.h"
/** @addtogroup FM33LR0XX_FL_Driver
  * @{
  */
/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup QSPI_FL_ES_INIT QSPI Exported Init structures
  * @{
  */

/**
  * @brief FL QSPI Init Sturcture definition
  */
typedef struct
{
    /* ??????? */	
    uint32_t ClockPrescaler;    
    /* FIFO?? */                          
    uint32_t FifoThreshold;     
    /* ?????? */                          
    uint32_t SampleShifting;    
    /* nCS??????? */                                                            
    uint32_t ChipSelectHighTime;
    /* Clock Mode */                                                        
    uint32_t ClockMode;
	
}QSPI_InitTypeDef;

typedef struct
{
    /* instruction phase. */
    uint32_t Instruction;
    uint32_t InstructionMode;
 
    /* addr phase. */
    uint32_t Address;
    uint32_t AddressSize;
    uint32_t AddressMode;
 
    /* alt phase. */
    uint32_t AlternateByte;
    uint32_t AlternateByteSize;
    uint32_t AlternateByteMode;
 
    /* dummy phase. */
    uint32_t DummyCycles;
    
    /* data phase. */
    uint32_t DataMode;
    uint32_t DataLen;

}QSPI_CmdTypeDef;
/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup QSPI_FL_Exported_Constants QSPI Exported Constants
  * @{
  */

#define    QSPI_CR_PRESCALER_Pos                                  (24U)
#define    QSPI_CR_PRESCALER_Msk                                  (0xffU << QSPI_CR_PRESCALER_Pos)
#define    QSPI_CR_PRESCALER                                      QSPI_CR_PRESCALER_Msk

#define    QSPI_CR_PMM_Pos                                        (23U)
#define    QSPI_CR_PMM_Msk                                        (0x1U << QSPI_CR_PMM_Pos)
#define    QSPI_CR_PMM                                            QSPI_CR_PMM_Msk

#define    QSPI_CR_TOIE_Pos                                       (20U)
#define    QSPI_CR_TOIE_Msk                                       (0x1U << QSPI_CR_TOIE_Pos)
#define    QSPI_CR_TOIE                                           QSPI_CR_TOIE_Msk

#define    QSPI_CR_SMIE_Pos                                       (19U)
#define    QSPI_CR_SMIE_Msk                                       (0x1U << QSPI_CR_SMIE_Pos)
#define    QSPI_CR_SMIE                                           QSPI_CR_SMIE_Msk

#define    QSPI_CR_FTIE_Pos                                       (18U)
#define    QSPI_CR_FTIE_Msk                                       (0x1U << QSPI_CR_FTIE_Pos)
#define    QSPI_CR_FTIE                                           QSPI_CR_FTIE_Msk

#define    QSPI_CR_TCIE_Pos                                       (17U)
#define    QSPI_CR_TCIE_Msk                                       (0x1U << QSPI_CR_TCIE_Pos)
#define    QSPI_CR_TCIE                                           QSPI_CR_TCIE_Msk

#define    QSPI_CR_TEIE_Pos                                       (16U)
#define    QSPI_CR_TEIE_Msk                                       (0x1U << QSPI_CR_TEIE_Pos)
#define    QSPI_CR_TEIE                                           QSPI_CR_TEIE_Msk

#define    QSPI_CR_FIFOTHR_Pos                                    (8U)
#define    QSPI_CR_FIFOTHR_Msk                                    (0xfU << QSPI_CR_FIFOTHR_Pos)
#define    QSPI_CR_FIFOTHR                                        QSPI_CR_FIFOTHR_Msk

#define    QSPI_CR_SSHFT_Pos                                      (4U)
#define    QSPI_CR_SSHFT_Msk                                      (0x1U << QSPI_CR_SSHFT_Pos)
#define    QSPI_CR_SSHFT                                          QSPI_CR_SSHFT_Msk

#define    QSPI_CR_TCEN_Pos                                       (3U)
#define    QSPI_CR_TCEN_Msk                                       (0x1U << QSPI_CR_TCEN_Pos)
#define    QSPI_CR_TCEN                                           QSPI_CR_TCEN_Msk

#define    QSPI_CR_DMAEN_Pos                                      (2U)
#define    QSPI_CR_DMAEN_Msk                                      (0x1U << QSPI_CR_DMAEN_Pos)
#define    QSPI_CR_DMAEN                                          QSPI_CR_DMAEN_Msk

#define    QSPI_CR_ABORT_Pos                                      (1U)
#define    QSPI_CR_ABORT_Msk                                      (0x1U << QSPI_CR_ABORT_Pos)
#define    QSPI_CR_ABORT                                          QSPI_CR_ABORT_Msk

#define    QSPI_CR_EN_Pos                                         (0U)
#define    QSPI_CR_EN_Msk                                         (0x1U << QSPI_CR_EN_Pos)
#define    QSPI_CR_EN                                             QSPI_CR_EN_Msk

#define    QSPI_CFG_CSHT_Pos                                      (8U)
#define    QSPI_CFG_CSHT_Msk                                      (0x7U << QSPI_CFG_CSHT_Pos)
#define    QSPI_CFG_CSHT                                          QSPI_CFG_CSHT_Msk

#define    QSPI_CFG_CKMODE_Pos                                    (0U)
#define    QSPI_CFG_CKMODE_Msk                                    (0x1U << QSPI_CFG_CKMODE_Pos)
#define    QSPI_CFG_CKMODE                                        QSPI_CFG_CKMODE_Msk

#define    QSPI_SR_FIFOLVL_Pos                                    (8U)
#define    QSPI_SR_FIFOLVL_Msk                                    (0x1fU << QSPI_SR_FIFOLVL_Pos)
#define    QSPI_SR_FIFOLVL                                        QSPI_SR_FIFOLVL_Msk

#define    QSPI_SR_BUSY_Pos                                       (5U)
#define    QSPI_SR_BUSY_Msk                                       (0x1U << QSPI_SR_BUSY_Pos)
#define    QSPI_SR_BUSY                                           QSPI_SR_BUSY_Msk

#define    QSPI_SR_TOF_Pos                                        (4U)
#define    QSPI_SR_TOF_Msk                                        (0x1U << QSPI_SR_TOF_Pos)
#define    QSPI_SR_TOF                                            QSPI_SR_TOF_Msk

#define    QSPI_SR_SMF_Pos                                        (3U)
#define    QSPI_SR_SMF_Msk                                        (0x1U << QSPI_SR_SMF_Pos)
#define    QSPI_SR_SMF                                            QSPI_SR_SMF_Msk

