Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Inc/fm33ld5xx_fl_qspi.h
#define    QSPI_SR_FTF_Pos                                        (2U)
#define    QSPI_SR_FTF_Msk                                        (0x1U << QSPI_SR_FTF_Pos)
#define    QSPI_SR_FTF                                            QSPI_SR_FTF_Msk

#define    QSPI_SR_TCF_Pos                                        (1U)
#define    QSPI_SR_TCF_Msk                                        (0x1U << QSPI_SR_TCF_Pos)
#define    QSPI_SR_TCF                                            QSPI_SR_TCF_Msk

#define    QSPI_DATALEN_DATALEN_Pos                               (0U)
#define    QSPI_DATALEN_DATALEN_Msk                               (0xffffffffU << QSPI_DATALEN_DATALEN_Pos)
#define    QSPI_DATALEN_DATALEN                                   QSPI_DATALEN_DATALEN_Msk

#define    QSPI_CCR_CRM_Pos                                       (28U)
#define    QSPI_CCR_CRM_Msk                                       (0x1U << QSPI_CCR_CRM_Pos)
#define    QSPI_CCR_CRM                                           QSPI_CCR_CRM_Msk

#define    QSPI_CCR_OPMODE_Pos                                    (26U)
#define    QSPI_CCR_OPMODE_Msk                                    (0x3U << QSPI_CCR_OPMODE_Pos)
#define    QSPI_CCR_OPMODE                                        QSPI_CCR_OPMODE_Msk

#define    QSPI_CCR_DMODE_Pos                                     (24U)
#define    QSPI_CCR_DMODE_Msk                                     (0x3U << QSPI_CCR_DMODE_Pos)
#define    QSPI_CCR_DMODE                                         QSPI_CCR_DMODE_Msk

#define    QSPI_CCR_DUMCYC_Pos                                    (18U)
#define    QSPI_CCR_DUMCYC_Msk                                    (0x1fU << QSPI_CCR_DUMCYC_Pos)
#define    QSPI_CCR_DUMCYC                                        QSPI_CCR_DUMCYC_Msk

#define    QSPI_CCR_ABSIZE_Pos                                    (16U)
#define    QSPI_CCR_ABSIZE_Msk                                    (0x3U << QSPI_CCR_ABSIZE_Pos)
#define    QSPI_CCR_ABSIZE                                        QSPI_CCR_ABSIZE_Msk

#define    QSPI_CCR_ABMODE_Pos                                    (14U)
#define    QSPI_CCR_ABMODE_Msk                                    (0x3U << QSPI_CCR_ABMODE_Pos)
#define    QSPI_CCR_ABMODE                                        QSPI_CCR_ABMODE_Msk

#define    QSPI_CCR_ADSIZE_Pos                                    (12U)
#define    QSPI_CCR_ADSIZE_Msk                                    (0x3U << QSPI_CCR_ADSIZE_Pos)
#define    QSPI_CCR_ADSIZE                                        QSPI_CCR_ADSIZE_Msk

#define    QSPI_CCR_ADMODE_Pos                                    (10U)
#define    QSPI_CCR_ADMODE_Msk                                    (0x3U << QSPI_CCR_ADMODE_Pos)
#define    QSPI_CCR_ADMODE                                        QSPI_CCR_ADMODE_Msk

#define    QSPI_CCR_IMODE_Pos                                     (8U)
#define    QSPI_CCR_IMODE_Msk                                     (0x3U << QSPI_CCR_IMODE_Pos)
#define    QSPI_CCR_IMODE                                         QSPI_CCR_IMODE_Msk

#define    QSPI_CCR_INSTRUCTION_Pos                               (0U)
#define    QSPI_CCR_INSTRUCTION_Msk                               (0xffU << QSPI_CCR_INSTRUCTION_Pos)
#define    QSPI_CCR_INSTRUCTION                                   QSPI_CCR_INSTRUCTION_Msk

#define    QSPI_ADDR_ADDR_Pos                                     (0U)
#define    QSPI_ADDR_ADDR_Msk                                     (0xffffffffU << QSPI_ADDR_ADDR_Pos)
#define    QSPI_ADDR_ADDR                                         QSPI_ADDR_ADDR_Msk

#define    QSPI_ABR_ABR_Pos                                       (0U)
#define    QSPI_ABR_ABR_Msk                                       (0xffffffffU << QSPI_ABR_ABR_Pos)
#define    QSPI_ABR_ABR                                           QSPI_ABR_ABR_Msk

#define    QSPI_DATA_DATA_Pos                                     (0U)
#define    QSPI_DATA_DATA_Msk                                     (0xffffffffU << QSPI_DATA_DATA_Pos)
#define    QSPI_DATA_DATA                                         QSPI_DATA_DATA_Msk

#define    QSPI_SMSK_SMSK_Pos                                     (0U)
#define    QSPI_SMSK_SMSK_Msk                                     (0xffffffffU << QSPI_SMSK_SMSK_Pos)
#define    QSPI_SMSK_SMSK                                         QSPI_SMSK_SMSK_Msk

#define    QSPI_SMAT_SMAT_Pos                                     (0U)
#define    QSPI_SMAT_SMAT_Msk                                     (0xffffffffU << QSPI_SMAT_SMAT_Pos)
#define    QSPI_SMAT_SMAT                                         QSPI_SMAT_SMAT_Msk

#define    QSPI_PITV_PITV_Pos                                     (0U)
#define    QSPI_PITV_PITV_Msk                                     (0xffffU << QSPI_PITV_PITV_Pos)
#define    QSPI_PITV_PITV                                         QSPI_PITV_PITV_Msk

#define    QSPI_TOR_TO_Pos                                        (0U)
#define    QSPI_TOR_TO_Msk                                        (0xffffU << QSPI_TOR_TO_Pos)
#define    QSPI_TOR_TO                                            QSPI_TOR_TO_Msk


#define    FL_QSPI_MODE_AND                                       (0x0U << QSPI_CR_PMM_Pos)
#define    FL_QSPI_MODE_OR                                        (0x1U << QSPI_CR_PMM_Pos)


#define    FL_QSPI_FIFOTHR_1                                      (0x0U << QSPI_CR_FIFOTHR_Pos)
#define    FL_QSPI_FIFOTHR_2                                      (0x1U << QSPI_CR_FIFOTHR_Pos)
#define    FL_QSPI_FIFOTHR_3                                      (0x2U << QSPI_CR_FIFOTHR_Pos)
#define    FL_QSPI_FIFOTHR_4                                      (0x3U << QSPI_CR_FIFOTHR_Pos)
#define    FL_QSPI_FIFOTHR_5                                      (0x4U << QSPI_CR_FIFOTHR_Pos)
#define    FL_QSPI_FIFOTHR_6                                      (0x5U << QSPI_CR_FIFOTHR_Pos)
#define    FL_QSPI_FIFOTHR_7                                      (0x6U << QSPI_CR_FIFOTHR_Pos)
#define    FL_QSPI_FIFOTHR_8                                      (0x7U << QSPI_CR_FIFOTHR_Pos)
#define    FL_QSPI_FIFOTHR_9                                      (0x8U << QSPI_CR_FIFOTHR_Pos)
#define    FL_QSPI_FIFOTHR_10                                     (0x9U << QSPI_CR_FIFOTHR_Pos)
#define    FL_QSPI_FIFOTHR_11                                     (0xaU << QSPI_CR_FIFOTHR_Pos)
#define    FL_QSPI_FIFOTHR_12                                     (0xbU << QSPI_CR_FIFOTHR_Pos)
#define    FL_QSPI_FIFOTHR_13                                     (0xcU << QSPI_CR_FIFOTHR_Pos)
#define    FL_QSPI_FIFOTHR_14                                     (0xdU << QSPI_CR_FIFOTHR_Pos)
#define    FL_QSPI_FIFOTHR_15                                     (0xeU << QSPI_CR_FIFOTHR_Pos)
#define    FL_QSPI_FIFOTHR_16                                     (0xfU << QSPI_CR_FIFOTHR_Pos)


#define    FL_QSPI_CYCLE_1                                        (0x0U << QSPI_CFG_CSHT_Pos)
#define    FL_QSPI_CYCLE_2                                        (0x1U << QSPI_CFG_CSHT_Pos)
#define    FL_QSPI_CYCLE_3                                        (0x2U << QSPI_CFG_CSHT_Pos)
#define    FL_QSPI_CYCLE_4                                        (0x3U << QSPI_CFG_CSHT_Pos)
#define    FL_QSPI_CYCLE_5                                        (0x4U << QSPI_CFG_CSHT_Pos)
#define    FL_QSPI_CYCLE_6                                        (0x5U << QSPI_CFG_CSHT_Pos)
#define    FL_QSPI_CYCLE_7                                        (0x6U << QSPI_CFG_CSHT_Pos)
#define    FL_QSPI_CYCLE_8                                        (0x7U << QSPI_CFG_CSHT_Pos)


#define    FL_QSPI_CLKMODE_0                                      (0x0U << QSPI_CFG_CKMODE_Pos)
#define    FL_QSPI_CLKMODE_3                                      (0x1U << QSPI_CFG_CKMODE_Pos)


#define    FL_QSPI_SEND_COMMAND_EVERYTIME                         (0x0U << QSPI_CCR_CRM_Pos)
#define    FL_QSPI_SEND_COMMAND_ONCE                              (0x1U << QSPI_CCR_CRM_Pos)


#define    FL_QSPI_OPERATION_MODE_WRITE                           (0x0U << QSPI_CCR_OPMODE_Pos)
#define    FL_QSPI_OPERATION_MODE_READ                            (0x1U << QSPI_CCR_OPMODE_Pos)
#define    FL_QSPI_OPERATION_MODE_QUERY                           (0x2U << QSPI_CCR_OPMODE_Pos)
#define    FL_QSPI_OPERATION_MODE_MAP                             (0x3U << QSPI_CCR_OPMODE_Pos)


#define    FL_QSPI_DATA_MODE_NONE                                 (0x0U << QSPI_CCR_DMODE_Pos)
#define    FL_QSPI_DATA_MODE_SINGLE                               (0x1U << QSPI_CCR_DMODE_Pos)
#define    FL_QSPI_DATA_MODE_DOUBLE                               (0x2U << QSPI_CCR_DMODE_Pos)
#define    FL_QSPI_DATA_MODE_FOUR                                 (0x3U << QSPI_CCR_DMODE_Pos)

#define    FL_QSPI_AB_SIZE_8bits                                  (0x0U << QSPI_CCR_ABSIZE_Pos)
#define    FL_QSPI_AB_SIZE_16bits                                 (0x1U << QSPI_CCR_ABSIZE_Pos)
#define    FL_QSPI_AB_SIZE_24bits                                 (0x2U << QSPI_CCR_ABSIZE_Pos)
#define    FL_QSPI_AB_SIZE_32bits                                 (0x3U << QSPI_CCR_ABSIZE_Pos)


#define    FL_QSPI_AB_MODE_NONE                                   (0x0U << QSPI_CCR_ABMODE_Pos)
#define    FL_QSPI_AB_MODE_SINGLE                                 (0x1U << QSPI_CCR_ABMODE_Pos)
#define    FL_QSPI_AB_MODE_DOUBLE                                 (0x2U << QSPI_CCR_ABMODE_Pos)
#define    FL_QSPI_AB_MODE_FOUR                                   (0x3U << QSPI_CCR_ABMODE_Pos)


#define    FL_QSPI_AD_SIZE_8bits                                  (0x0U << QSPI_CCR_ADSIZE_Pos)
#define    FL_QSPI_AD_SIZE_16bits                                 (0x1U << QSPI_CCR_ADSIZE_Pos)
#define    FL_QSPI_AD_SIZE_24bits                                 (0x2U << QSPI_CCR_ADSIZE_Pos)
#define    FL_QSPI_AD_SIZE_32bits                                 (0x3U << QSPI_CCR_ADSIZE_Pos)


