Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Inc/fm33ld5xx_fl_qspi.h
#define    FL_QSPI_AD_MODE_NONE                                   (0x0U << QSPI_CCR_ADMODE_Pos)
#define    FL_QSPI_AD_MODE_SINGLE                                 (0x1U << QSPI_CCR_ADMODE_Pos)
#define    FL_QSPI_AD_MODE_DOUBLE                                 (0x2U << QSPI_CCR_ADMODE_Pos)
#define    FL_QSPI_AD_MODE_FOUR                                   (0x3U << QSPI_CCR_ADMODE_Pos)


#define    FL_QSPI_IMODE_NONE                                     (0x0U << QSPI_CCR_IMODE_Pos)
#define    FL_QSPI_IMODE_SINGLE                                   (0x1U << QSPI_CCR_IMODE_Pos)
#define    FL_QSPI_IMODE_DOUBLE                                   (0x2U << QSPI_CCR_IMODE_Pos)
#define    FL_QSPI_IMODE_FOUR                                     (0x3U << QSPI_CCR_IMODE_Pos)


/**
  * @}
  */
/* Exported functions ---------------------------------------------------------------------------------*/
/** @defgroup QSPI_FL_Exported_Functions QSPI Exported Functions
  * @{
  */

/**
  * @brief    
  * @rmtoll   CR    PRESCALER    FL_QSPI_WriteClockPrescaler
  * @param    QSPIx QSPI instance
  * @param    div 
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_WriteClockPrescaler(QSPI_Type* QSPIx, uint32_t div)
{
    MODIFY_REG(QSPIx->CR, (0xffU << 24U), (div << 24U));
}

/**
  * @brief    
  * @rmtoll   CR    PRESCALER    FL_QSPI_ReadClockPrescaler
  * @param    QSPIx QSPI instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_QSPI_ReadClockPrescaler(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->CR, (0xffU << 24U)) >> 24U);
}

/**
  * @brief    
  * @rmtoll   CR    PMM    FL_QSPI_SetPMMmode
  * @param    QSPIx QSPI instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_QSPI_MODE_AND
  *           @arg @ref FL_QSPI_MODE_OR
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_SetPMMmode(QSPI_Type* QSPIx, uint32_t mode)
{
    MODIFY_REG(QSPIx->CR, QSPI_CR_PMM_Msk, mode);
}

/**
  * @brief    
  * @rmtoll   CR    PMM    FL_QSPI_GetPMMmode
  * @param    QSPIx QSPI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_QSPI_MODE_AND
  *           @arg @ref FL_QSPI_MODE_OR
  */
__STATIC_INLINE uint32_t FL_QSPI_GetPMMmode(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->CR, QSPI_CR_PMM_Msk));
}

/**
  * @brief    
  * @rmtoll   CR    TOIE    FL_QSPI_EnableIT_Timeout
  * @param    QSPIx QSPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_EnableIT_Timeout(QSPI_Type* QSPIx)
{
    SET_BIT(QSPIx->CR, QSPI_CR_TOIE_Msk);
}

/**
  * @brief    
  * @rmtoll   CR    TOIE    FL_QSPI_IsEnabledIT_Timeout
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_QSPI_IsEnabledIT_Timeout(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->CR, QSPI_CR_TOIE_Msk) == QSPI_CR_TOIE_Msk);
}

/**
  * @brief    
  * @rmtoll   CR    TOIE    FL_QSPI_DisableIT_Timeout
  * @param    QSPIx QSPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_DisableIT_Timeout(QSPI_Type* QSPIx)
{
    CLEAR_BIT(QSPIx->CR, QSPI_CR_TOIE_Msk);
}

/**
  * @brief    
  * @rmtoll   CR    SMIE    FL_QSPI_EnableIT_StateMatch
  * @param    QSPIx QSPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_EnableIT_StateMatch(QSPI_Type* QSPIx)
{
    SET_BIT(QSPIx->CR, QSPI_CR_SMIE_Msk);
}

/**
  * @brief    
  * @rmtoll   CR    SMIE    FL_QSPI_IsEnabledIT_StateMatch
  * @param    QSPIx QSPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_QSPI_IsEnabledIT_StateMatch(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->CR, QSPI_CR_SMIE_Msk) == QSPI_CR_SMIE_Msk);
}

/**
  * @brief    
  * @rmtoll   CR    SMIE    FL_QSPI_DisableIT_StateMatch
  * @param    QSPIx QSPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_DisableIT_StateMatch(QSPI_Type* QSPIx)
{
    CLEAR_BIT(QSPIx->CR, QSPI_CR_SMIE_Msk);
}

/**
  * @brief    
  * @rmtoll   CR    FTIE    FL_QSPI_EnableIT_FIFOLevel
  * @param    QSPIx QSPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_EnableIT_FIFOLevel(QSPI_Type* QSPIx)
{
    SET_BIT(QSPIx->CR, QSPI_CR_FTIE_Msk);
}

/**
  * @brief    
  * @rmtoll   CR    FTIE    FL_QSPI_IsEnabledIT_FIFOLevel
  * @param    QSPIx QSPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_QSPI_IsEnabledIT_FIFOLevel(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->CR, QSPI_CR_FTIE_Msk) == QSPI_CR_FTIE_Msk);
}

/**
  * @brief    
  * @rmtoll   CR    FTIE    FL_QSPI_DisableIT_FIFOLevel
  * @param    QSPIx QSPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_DisableIT_FIFOLevel(QSPI_Type* QSPIx)
{
    CLEAR_BIT(QSPIx->CR, QSPI_CR_FTIE_Msk);
}

/**
  * @brief    
  * @rmtoll   CR    TCIE    FL_QSPI_EnableIT_TransferComplete
  * @param    QSPIx QSPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_EnableIT_TransferComplete(QSPI_Type* QSPIx)
{
    SET_BIT(QSPIx->CR, QSPI_CR_TCIE_Msk);
}

/**
  * @brief    
  * @rmtoll   CR    TCIE    FL_QSPI_IsEnabledIT_TransferComplete
  * @param    QSPIx QSPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_QSPI_IsEnabledIT_TransferComplete(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->CR, QSPI_CR_TCIE_Msk) == QSPI_CR_TCIE_Msk);
}

/**
  * @brief    
  * @rmtoll   CR    TCIE    FL_QSPI_DisableIT_TransferComplete
  * @param    QSPIx QSPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_DisableIT_TransferComplete(QSPI_Type* QSPIx)
{
    CLEAR_BIT(QSPIx->CR, QSPI_CR_TCIE_Msk);
}

/**
  * @brief    
  * @rmtoll   CR    TEIE    FL_QSPI_EnableIT_TransferError
  * @param    QSPIx QSPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_EnableIT_TransferError(QSPI_Type* QSPIx)
{
    SET_BIT(QSPIx->CR, QSPI_CR_TEIE_Msk);
}

/**
  * @brief    
  * @rmtoll   CR    TEIE    FL_QSPI_IsEnabledIT_TransferError
  * @param    QSPIx QSPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_QSPI_IsEnabledIT_TransferError(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->CR, QSPI_CR_TEIE_Msk) == QSPI_CR_TEIE_Msk);
}

/**
  * @brief    
  * @rmtoll   CR    TEIE    FL_QSPI_DisableIT_TransferError
  * @param    QSPIx QSPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_DisableIT_TransferError(QSPI_Type* QSPIx)
{
    CLEAR_BIT(QSPIx->CR, QSPI_CR_TEIE_Msk);
}

/**
  * @brief    
  * @rmtoll   CR    FIFOTHR    FL_QSPI_SetFIFOLevel
  * @param    QSPIx QSPI instance
  * @param    level This parameter can be one of the following values:
  *           @arg @ref FL_QSPI_FIFOTHR_1
  *           @arg @ref FL_QSPI_FIFOTHR_2
  *           @arg @ref FL_QSPI_FIFOTHR_3
  *           @arg @ref FL_QSPI_FIFOTHR_4
  *           @arg @ref FL_QSPI_FIFOTHR_5
  *           @arg @ref FL_QSPI_FIFOTHR_6
  *           @arg @ref FL_QSPI_FIFOTHR_7
  *           @arg @ref FL_QSPI_FIFOTHR_8
  *           @arg @ref FL_QSPI_FIFOTHR_9
  *           @arg @ref FL_QSPI_FIFOTHR_10
  *           @arg @ref FL_QSPI_FIFOTHR_11
  *           @arg @ref FL_QSPI_FIFOTHR_12
  *           @arg @ref FL_QSPI_FIFOTHR_13
  *           @arg @ref FL_QSPI_FIFOTHR_14
  *           @arg @ref FL_QSPI_FIFOTHR_15
  *           @arg @ref FL_QSPI_FIFOTHR_16
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_SetFIFOLevel(QSPI_Type* QSPIx, uint32_t level)
{
    MODIFY_REG(QSPIx->CR, QSPI_CR_FIFOTHR_Msk, level);
}

/**
  * @brief    
  * @rmtoll   CR    FIFPTHR    FL_QSPI_GetFIFOLevel
  * @param    QSPIx QSPI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_QSPI_FIFOTHR_1
  *           @arg @ref FL_QSPI_FIFOTHR_2
  *           @arg @ref FL_QSPI_FIFOTHR_3
  *           @arg @ref FL_QSPI_FIFOTHR_4
  *           @arg @ref FL_QSPI_FIFOTHR_5
  *           @arg @ref FL_QSPI_FIFOTHR_6
  *           @arg @ref FL_QSPI_FIFOTHR_7
  *           @arg @ref FL_QSPI_FIFOTHR_8
  *           @arg @ref FL_QSPI_FIFOTHR_9
  *           @arg @ref FL_QSPI_FIFOTHR_10
  *           @arg @ref FL_QSPI_FIFOTHR_11
  *           @arg @ref FL_QSPI_FIFOTHR_12
  *           @arg @ref FL_QSPI_FIFOTHR_13
  *           @arg @ref FL_QSPI_FIFOTHR_14
  *           @arg @ref FL_QSPI_FIFOTHR_15
  *           @arg @ref FL_QSPI_FIFOTHR_16
  */
__STATIC_INLINE uint32_t FL_QSPI_GetFIFOLevel(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->CR, QSPI_CR_FIFOTHR_Msk));
}

/**
  * @brief    
  * @rmtoll   CR    SSHFT    FL_QSPI_EnableDelayedSampling
  * @param    QSPIx QSPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_EnableDelayedSampling(QSPI_Type* QSPIx)
{
    SET_BIT(QSPIx->CR, QSPI_CR_SSHFT_Msk);
}

/**
  * @brief    
  * @rmtoll   CR    SSHFT    FL_QSPI_IsEnabledDelayedSampling
  * @param    QSPIx QSPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_QSPI_IsEnabledDelayedSampling(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->CR, QSPI_CR_SSHFT_Msk) == QSPI_CR_SSHFT_Msk);
}

/**
  * @brief    
  * @rmtoll   CR    SSHFT    FL_QSPI_DisableDelayedSampling
  * @param    QSPIx QSPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_DisableDelayedSampling(QSPI_Type* QSPIx)
{
    CLEAR_BIT(QSPIx->CR, QSPI_CR_SSHFT_Msk);
}

/**
  * @brief    
  * @rmtoll   CR    TCEN    FL_QSPI_EnableTimeout
  * @param    QSPIx QSPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_EnableTimeout(QSPI_Type* QSPIx)
{
    SET_BIT(QSPIx->CR, QSPI_CR_TCEN_Msk);
}

/**
  * @brief    
  * @rmtoll   CR    TCEN    FL_QSPI_IsEnabledTimeout
  * @param    QSPIx QSPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_QSPI_IsEnabledTimeout(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->CR, QSPI_CR_TCEN_Msk) == QSPI_CR_TCEN_Msk);
}

/**
  * @brief    
  * @rmtoll   CR    TCEN    FL_QSPI_DisableTimeout
  * @param    QSPIx QSPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_DisableTimeout(QSPI_Type* QSPIx)
{
    CLEAR_BIT(QSPIx->CR, QSPI_CR_TCEN_Msk);
}

/**
  * @brief    
  * @rmtoll   CR    DMAEN    FL_QSPI_EnableDMAReq_DMA
  * @param    QSPIx QSPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_EnableDMAReq_DMA(QSPI_Type* QSPIx)
{
    SET_BIT(QSPIx->CR, QSPI_CR_DMAEN_Msk);
}

/**
  * @brief    
  * @rmtoll   CR    DMAEN    FL_QSPI_IsEnabledDMAReq_DMA
  * @param    QSPIx QSPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_QSPI_IsEnabledDMAReq_DMA(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->CR, QSPI_CR_DMAEN_Msk) == QSPI_CR_DMAEN_Msk);
}

/**
  * @brief    
  * @rmtoll   CR    DMAEN    FL_QSPI_DisableDMAReq_DMA
  * @param    QSPIx QSPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_DisableDMAReq_DMA(QSPI_Type* QSPIx)
{
    CLEAR_BIT(QSPIx->CR, QSPI_CR_DMAEN_Msk);
}

/**
  * @brief    
  * @rmtoll   CR    ABORT    FL_QSPI_EnableABORT
  * @param    QSPIx QSPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_EnableABORT(QSPI_Type* QSPIx)
{
    SET_BIT(QSPIx->CR, QSPI_CR_ABORT_Msk);
}

/**
  * @brief    
  * @rmtoll   CR    EN    FL_QSPI_Enable
  * @param    QSPIx QSPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_Enable(QSPI_Type* QSPIx)
{
    SET_BIT(QSPIx->CR, QSPI_CR_EN_Msk);
}

/**
  * @brief    
  * @rmtoll   CR    EN    FL_QSPI_IsEnabled
  * @param    QSPIx QSPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_QSPI_IsEnabled(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->CR, QSPI_CR_EN_Msk) == QSPI_CR_EN_Msk);
}

/**
  * @brief    
  * @rmtoll   CR    EN    FL_QSPI_Disable
  * @param    QSPIx QSPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_Disable(QSPI_Type* QSPIx)
{
    CLEAR_BIT(QSPIx->CR, QSPI_CR_EN_Msk);
}

/**
  * @brief    
  * @rmtoll   CFG    CSHT    FL_QSPI_SetCSHoldTime
  * @param    QSPIx QSPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_SetCSHoldTime(QSPI_Type* QSPIx, uint32_t cycle)
{
    MODIFY_REG(QSPIx->CFGR, QSPI_CFG_CSHT_Msk, cycle);
}

/**
  * @brief    
  * @rmtoll   CFG    CSHT    FL_QSPI_GetCSHoldTime
  * @param    QSPIx QSPI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_QSPI_CYCLE_1
  *           @arg @ref FL_QSPI_CYCLE_2
  *           @arg @ref FL_QSPI_CYCLE_3
  *           @arg @ref FL_QSPI_CYCLE_4
  *           @arg @ref FL_QSPI_CYCLE_5
  *           @arg @ref FL_QSPI_CYCLE_6
  *           @arg @ref FL_QSPI_CYCLE_7
  *           @arg @ref FL_QSPI_CYCLE_8
  */
__STATIC_INLINE uint32_t FL_QSPI_GetCSHoldTime(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->CFGR, QSPI_CFG_CSHT_Msk));
}

/**
  * @brief    
  * @rmtoll   CFG    CKMODE    FL_QSPI_SetClockMode
  * @param    QSPIx QSPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_SetClockMode(QSPI_Type* QSPIx, uint32_t mode)
{
    MODIFY_REG(QSPIx->CFGR, QSPI_CFG_CKMODE_Msk, mode);
}

/**
  * @brief    
  * @rmtoll   CFG    CKMODE    FL_QSPI_GetClockMode
  * @param    QSPIx QSPI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_QSPI_CLKMODE_0
  *           @arg @ref FL_QSPI_CLKMODE_3
  */
__STATIC_INLINE uint32_t FL_QSPI_GetClockMode(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->CFGR, QSPI_CFG_CKMODE_Msk));
}

/**
  * @brief    
  * @rmtoll   SR    FIFOLVL    FL_QSPI_ReadFIFOLevel
  * @param    QSPIx QSPI instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_QSPI_ReadFIFOLevel(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->SR, (0x1fU << 8U)) >> 8U);
}

/**
  * @brief    
  * @rmtoll   SR    BUSY    FL_QSPI_IsActiveFlag_Busy
  * @param    QSPIx QSPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_QSPI_IsActiveFlag_Busy(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->SR, QSPI_SR_BUSY_Msk) == (QSPI_SR_BUSY_Msk));
}

/**
  * @brief    
  * @rmtoll   SR    TOF    FL_QSPI_IsActiveFlag_Overtime
  * @param    QSPIx QSPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_QSPI_IsActiveFlag_Overtime(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->SR, QSPI_SR_TOF_Msk) == (QSPI_SR_TOF_Msk));
}

/**
  * @brief    
  * @rmtoll   SR    TOF    FL_QSPI_ClearFlag_Overtime
  * @param    QSPIx QSPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_ClearFlag_Overtime(QSPI_Type* QSPIx)
{
    WRITE_REG(QSPIx->SR, QSPI_SR_TOF_Msk);
}

/**
  * @brief    
  * @rmtoll   SR    SMF    FL_QSPI_IsActiveFlag_StatusRegMatchSuccess
  * @param    QSPIx QSPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_QSPI_IsActiveFlag_StatusRegMatchSuccess(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->SR, QSPI_SR_SMF_Msk) == (QSPI_SR_SMF_Msk));
}

/**
  * @brief    
  * @rmtoll   SR    SMF    FL_QSPI_ClearFlag_StatusRegMatchSuccess
  * @param    QSPIx QSPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_ClearFlag_StatusRegMatchSuccess(QSPI_Type* QSPIx)
{
    WRITE_REG(QSPIx->SR, QSPI_SR_SMF_Msk);
}

/**
  * @brief    
  * @rmtoll   SR    FTF    FL_QSPI_IsActiveFlag_FIFOthreshold
  * @param    QSPIx QSPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_QSPI_IsActiveFlag_FIFOthreshold(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->SR, QSPI_SR_FTF_Msk) == (QSPI_SR_FTF_Msk));
}

/**
  * @brief    
  * @rmtoll   SR    FTF    FL_QSPI_ClearFlag_FIFOthreshold
  * @param    QSPIx QSPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_ClearFlag_FIFOthreshold(QSPI_Type* QSPIx)
{
    WRITE_REG(QSPIx->SR, QSPI_SR_FTF_Msk);
}

/**
  * @brief    
  * @rmtoll   SR    TCF    FL_QSPI_IsActiveFlag_TransferComplete
  * @param    QSPIx QSPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_QSPI_IsActiveFlag_TransferComplete(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->SR, QSPI_SR_TCF_Msk) == (QSPI_SR_TCF_Msk));
}

/**
  * @brief    
  * @rmtoll   SR    TCF    FL_QSPI_ClearFlag_TransferComplete
  * @param    QSPIx QSPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_ClearFlag_TransferComplete(QSPI_Type* QSPIx)
{
    WRITE_REG(QSPIx->SR, QSPI_SR_TCF_Msk);
}

/**
  * @brief    
  * @rmtoll   DATALEN    DATALEN    FL_QSPI_WriteDataLength
  * @param    QSPIx QSPI instance
  * @param    length 
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_WriteDataLength(QSPI_Type* QSPIx, uint32_t length)
{
    MODIFY_REG(QSPIx->DATALEN, (0xffffffffU << 0U), (length << 0U));
}

/**
  * @brief    
  * @rmtoll   DATALEN    DATALEN    FL_QSPI_ReadDataLength
  * @param    QSPIx QSPI instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_QSPI_ReadDataLength(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->DATALEN, (0xffffffffU << 0U)) >> 0U);
}

/**
  * @brief    
  * @rmtoll   CCR    CRM    FL_QSPI_SetContinuousReadMode
  * @param    QSPIx QSPI instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_QSPI_SEND_COMMAND_EVERYTIME
  *           @arg @ref FL_QSPI_SEND_COMMAND_ONCE
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_SetContinuousReadMode(QSPI_Type* QSPIx, uint32_t mode)
{
    MODIFY_REG(QSPIx->CCR, QSPI_CCR_CRM_Msk, mode);
}

/**
  * @brief    
  * @rmtoll   CCR    CRM    FL_QSPI_GetContinuousReadMode
  * @param    QSPIx QSPI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_QSPI_SEND_COMMAND_EVERYTIME
  *           @arg @ref FL_QSPI_SEND_COMMAND_ONCE
  */
__STATIC_INLINE uint32_t FL_QSPI_GetContinuousReadMode(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->CCR, QSPI_CCR_CRM_Msk));
}

/**
  * @brief    
  * @rmtoll   CCR    OPMODE    FL_QSPI_SetOperatingMode
  * @param    QSPIx QSPI instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_QSPI_OPERATION_MODE_WRITE
  *           @arg @ref FL_QSPI_OPERATION_MODE_READ
  *           @arg @ref FL_QSPI_OPERATION_MODE_QUERY
  *           @arg @ref FL_QSPI_OPERATION_MODE_MAP
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_SetOperatingMode(QSPI_Type* QSPIx, uint32_t mode)
{
    MODIFY_REG(QSPIx->CCR, QSPI_CCR_OPMODE_Msk, mode);
}

/**
  * @brief    
  * @rmtoll   CCR    OPMODE    FL_QSPI_GetOperatingMode
  * @param    QSPIx QSPI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_QSPI_OPERATION_MODE_WRITE
  *           @arg @ref FL_QSPI_OPERATION_MODE_READ
  *           @arg @ref FL_QSPI_OPERATION_MODE_QUERY
  *           @arg @ref FL_QSPI_OPERATION_MODE_MAP
  */
__STATIC_INLINE uint32_t FL_QSPI_GetOperatingMode(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->CCR, QSPI_CCR_OPMODE_Msk));
}

/**
  * @brief    
  * @rmtoll   CCR    DMODE    FL_QSPI_SetDataMode
  * @param    QSPIx QSPI instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_QSPI_DATAT_MODE_NONE
  *           @arg @ref FL_QSPI_DATAT_MODE_SINGLE
  *           @arg @ref FL_QSPI_DATAT_MODE_DOUBLE
  *           @arg @ref FL_QSPI_DATAT_MODE_FOUR
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_SetDataMode(QSPI_Type* QSPIx, uint32_t mode)
{
    MODIFY_REG(QSPIx->CCR, QSPI_CCR_DMODE_Msk, mode);
}

/**
  * @brief    
  * @rmtoll   CCR    DMODE    FL_QSPI_GetDataMode
  * @param    QSPIx QSPI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_QSPI_DATA_MODE_NONE
  *           @arg @ref FL_QSPI_DATA_MODE_SINGLE
  *           @arg @ref FL_QSPI_DATA_MODE_DOUBLE
  *           @arg @ref FL_QSPI_DATA_MODE_FOUR
  */
__STATIC_INLINE uint32_t FL_QSPI_GetDataMode(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->CCR, QSPI_CCR_DMODE_Msk));
}

/**
  * @brief    
  * @rmtoll   CCR    DUMCYC    FL_QSPI_WriteDummyCycle
  * @param    QSPIx QSPI instance
  * @param    cycle 
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_WriteDummyCycle(QSPI_Type* QSPIx, uint32_t cycle)
{
    MODIFY_REG(QSPIx->CCR, (0x1fU << 18U), (cycle << 18U));
}

/**
  * @brief    
  * @rmtoll   CCR    DUMCYC    FL_QSPI_ReadDummyCycle
  * @param    QSPIx QSPI instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_QSPI_ReadDummyCycle(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->CCR, (0x1fU << 18U)) >> 18U);
}

/**
  * @brief    
  * @rmtoll   CCR    ABSIZE    FL_QSPI_SetAlternateBytesSize
  * @param    QSPIx QSPI instance
  * @param    size This parameter can be one of the following values:
  *           @arg @ref FL_QSPI_AB_SIZE_8bits
  *           @arg @ref FL_QSPI_AB_SIZE_16bits
  *           @arg @ref FL_QSPI_AB_SIZE_24bits
  *           @arg @ref FL_QSPI_AB_SIZE_32bits
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_SetAlternateBytesSize(QSPI_Type* QSPIx, uint32_t size)
{
    MODIFY_REG(QSPIx->CCR, QSPI_CCR_ABSIZE_Msk, size);
}

/**
  * @brief    
  * @rmtoll   CCR    ABSIZE    FL_QSPI_GetAlternateBytesSize
  * @param    QSPIx QSPI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_QSPI_AB_SIZE_8bits
  *           @arg @ref FL_QSPI_AB_SIZE_16bits
  *           @arg @ref FL_QSPI_AB_SIZE_24bits
  *           @arg @ref FL_QSPI_AB_SIZE_32bits
  */
__STATIC_INLINE uint32_t FL_QSPI_GetAlternateBytesSize(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->CCR, QSPI_CCR_ABSIZE_Msk));
}

/**
  * @brief    
  * @rmtoll   CCR    ABMODE    FL_QSPI_SetAlternateBytesMode
  * @param    QSPIx QSPI instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_QSPI_AB_MODE_NONE
  *           @arg @ref FL_QSPI_AB_MODE_SINGLE
  *           @arg @ref FL_QSPI_AB_MODE_DOUBLE
  *           @arg @ref FL_QSPI_AB_MODE_FOUR
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_SetAlternateBytesMode(QSPI_Type* QSPIx, uint32_t mode)
{
    MODIFY_REG(QSPIx->CCR, QSPI_CCR_ABMODE_Msk, mode);
}

/**
  * @brief    
  * @rmtoll   CCR    ABMODE    FL_QSPI_GetAlternateBytesMode
  * @param    QSPIx QSPI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_QSPI_AB_MODE_NONE
  *           @arg @ref FL_QSPI_AB_MODE_SINGLE
  *           @arg @ref FL_QSPI_AB_MODE_DOUBLE
  *           @arg @ref FL_QSPI_AB_MODE_FOUR
  */
__STATIC_INLINE uint32_t FL_QSPI_GetAlternateBytesMode(QSPI_Type* QSPIx)
{
    return (uint32_t)(READ_BIT(QSPIx->CCR, QSPI_CCR_ABMODE_Msk));
}

/**
  * @brief    
  * @rmtoll   CCR    ADSIZE    FL_QSPI_SetAddressSize
  * @param    QSPIx QSPI instance
  * @param    size This parameter can be one of the following values:
  *           @arg @ref FL_QSPI_AD_SIZE_8bits
  *           @arg @ref FL_QSPI_AD_SIZE_16bits
  *           @arg @ref FL_QSPI_AD_SIZE_24bits
  *           @arg @ref FL_QSPI_AD_SIZE_32bits
  * @retval   None
  */
__STATIC_INLINE void FL_QSPI_SetAddressSize(QSPI_Type* QSPIx, uint32_t size)
{
    MODIFY_REG(QSPIx->CCR, QSPI_CCR_ADSIZE_Msk, size);
}

